TEST/src/req

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://dvar.centurylink.com/webservice/resourcemgmt/serviceTypes">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:DvarWebServiceRequest>
         <ser:ServiceName>ManageCustomerAppointmentInfo</ser:ServiceName>
         <ser:ServiceDetail>
            <ns3:ManageCustomerAppointmentInfoRequest xmlns:ns2="http://www.qwest.com/XMLSchema/BIM" xmlns:ns3="http://DVAR.centurylink.com/DVAR.xsd">
               <MessageInfo>
                  <AuthenticationInfo>
                     <AuthenticationId>DVARMON</AuthenticationId>
                     <AuthenticationPassword>${#TestCase#password}</AuthenticationPassword>
                  </AuthenticationInfo>
                  <ARTISRequestHeader>
                     <ARTISCorrelationId>844881671</ARTISCorrelationId>
                  </ARTISRequestHeader>
               </MessageInfo>
               <ManageCustomerAppointmentInfoRequestDetails>
                  <RootEntityDescribedBy>
                     <value>1057892</value>
                     <CharacteristicSpecification>
                        <name>UserID</name>
                     </CharacteristicSpecification>
                  </RootEntityDescribedBy>
                  <BusinessInteraction>
                     <RootEntityDescribedBy>
                        <value>RETAIL</value>
                        <CharacteristicSpecification>
                           <name>MarketUnit</name>
                        </CharacteristicSpecification>
                     </RootEntityDescribedBy>
                     <RootEntityDescribedBy>
                        <value>OUTSIDE_TECH</value>
                        <CharacteristicSpecification>
                           <name>DispatchType</name>
                        </CharacteristicSpecification>
                     </RootEntityDescribedBy>
                     <RootEntityDescribedBy>
                        <value>SELECT</value>
                        <CharacteristicSpecification>
                           <name>EventType</name>
                        </CharacteristicSpecification>
                     </RootEntityDescribedBy>
                     <RootEntityDescribedBy>
                        <value>ARNV1294758332</value>
                        <CharacteristicSpecification>
                           <name>InquiryReservationNumber</name>
                        </CharacteristicSpecification>
                     </RootEntityDescribedBy>
                     <RootEntityDescribedBy>
                        <value>DGWDFTRESNUM</value>
                        <CharacteristicSpecification>
                           <name>ARN</name>
                        </CharacteristicSpecification>
                     </RootEntityDescribedBy>
                     <RootEntityDescribedBy>
                        <value>PROVISIONING</value>
                        <CharacteristicSpecification>
                           <name>ServiceType</name>
                        </CharacteristicSpecification>
                     </RootEntityDescribedBy>
                     <RootEntityDescribedBy>
                        <value>LSVGNVXU</value>
                        <CharacteristicSpecification>
                           <name>WireCenterCLLI</name>
                        </CharacteristicSpecification>
                     </RootEntityDescribedBy>
                     <RootEntityDescribedBy>
                        <value>1294758332</value>
                        <CharacteristicSpecification>
                           <name>OrderNumber</name>
                        </CharacteristicSpecification>
                     </RootEntityDescribedBy>
                     <EntityRecognizedUsing xsi:type="ns3:CompositeEntityIdentification" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                        <EntityIdentificationSpecification>
                           <name>Appointment</name>
                        </EntityIdentificationSpecification>
                        <CompositeEntityIdentityComposedOf>
                           <value>2015-04-23</value>
                           <EntityIdentificationSpecification>
                              <name>AppointmentDate</name>
                           </EntityIdentificationSpecification>
                        </CompositeEntityIdentityComposedOf>
                        <CompositeEntityIdentityComposedOf>
                           <value>2015-04-23T10:00-0500</value>
                           <EntityIdentificationSpecification>
                              <name>AfterTime</name>
                           </EntityIdentificationSpecification>
                        </CompositeEntityIdentityComposedOf>
                        <CompositeEntityIdentityComposedOf>
                           <value>2015-04-23T19:00-0500</value>
                           <EntityIdentificationSpecification>
                              <name>BeforeTime</name>
                           </EntityIdentificationSpecification>
                        </CompositeEntityIdentityComposedOf>
                     </EntityRecognizedUsing>
                  </BusinessInteraction>
               </ManageCustomerAppointmentInfoRequestDetails>
            </ns3:ManageCustomerAppointmentInfoRequest>
         </ser:ServiceDetail>
      </ser:DvarWebServiceRequest>
   </soapenv:Body>
</soapenv:Envelope>